#+TITLE: A tale of two parsers, part 2
#+DATE: <2013-06-30 Sun>
#+AUTHOR: aki
#+EMAIL: aki@utahraptor
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not LOGBOOK) date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t toc:t todo:t |:t
#+CREATOR: Emacs 24.3.1 (Org mode 8.0.3)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

** Parsing function application

I've adapted the prototype I described before into the front-end for an ML compiler I've been working on, since at its core ML is syntactically similar (semantically similar as well of course) to the lambda calculus. Recall that the parser should enforce the usual rules of precedence and associativity in arithmetic expressions: `1 + 2 * 3` should be parsed as `1 + (2 * 3)`. This is relatively well-trodden ground, and most compiler texts address this by introducing precedence levels into the grammar.

In a full-fledged programming language like ML, there are other expressions that must have even higher precedence than multiplication, but aren't usually present in the simple calculator language, for instance function application (or function calls). In ML, function application is simply one expression followed by another: `f x` instead of `f(x)` as is the case in most languages with syntax derived from C. This poses a problem for a recursive descent parser, since the resulting grammar has a production that looks something like:

#+BEGIN_SRC
   expr -> expr expr (* function application *)
   expr -> if expr then expr else expr
   expr -> fn id => expr
   expr -> let id = expr in expr
   ...
#+END_SRC

This was the grammar I wrote in order to add function application to the parser I started with that did arithmetic only, and it grew out of my belief that as a functional, expression oriented language, ML should allow any expression to be called as a function in an application. For instance, the following are all legal ML programs:

#+BEGIN_SRC sml
  val x = (fn x => x) 1
  val z = let val x = 1 in fn y => x + y end 2
#+END_SRC

#+RESULTS:
: val x = 1 : int
: val z = 3 : int

However, the grammar poses a real problem for the parser writer: the production `expr -> expr expr` is left-recursive. This production is a pain to fix, and in fact I wasn't able to figure out how to remove the recursion, since the usual algorithm breaks the production into two pieces but the result in this case still has a left recursion.

The intention with this grammar is that the following snippet of ML should be parsed as a curried function application, allowing the usual lambda calculus style of supporting multiple arguments as in ML and Haskell:

#+BEGIN_SRC sml
  fun add x y z = x + y + z
  val sum1 = add 1 2 3
  val sum2 = (((add 1) 2) 3)
#+END_SRC

#+RESULTS:
: val add = fn : int -> int -> int -> int
: val sum1 = 6 : int
: val sum2 = 6 : int

What I decided was to attempt to fix the problem of parsing function application by ignoring support for curried functions, and add the following production to the grammar:

#+BEGIN_SRC
   exprs -> expr expr
   expr  -> if exprs then exprs else exprs
   expr  -> fn id => exprs
   expr  -> let id = exprs in exprs
   ... 
#+END_SRC

This grammar no longer has the problem that the previous one has, since `exprs` is not left-recursive. The `exprs` production can be implemented straightforwardly in the existing recursive descent parser:

#+BEGIN_SRC sml
  and exprs () : 'a A.t =
      let
         (* check if token is in FIRST(expr) *)
         fun FIRSTexpr (L.Id (pos, _))   = SOME pos
           | FIRSTexpr (L.Num (pos, _))  = SOME pos
           | FIRSTexpr (L.Bool (pos, _)) = SOME pos
           | FIRSTexpr (L.If pos)        = SOME pos
           | FIRSTexpr (L.Fn pos)        = SOME pos
           | FIRSTexpr (L.Let pos)       = SOME pos
           | FIRSTexpr (L.LParen pos)    = SOME pos
           | FIRSTexpr _                 = NONE
  
         val ast1 = expr ()
      in
         if has ()
            then case FIRSTexpr (peek ()) of
                     SOME pos => A.App (pos, ast1, expr ())
                   | NONE => ast1
         else ast1
      end
#+END_SRC

On line 13, this code parses a single expression, then proceeds to look ahead one token (via `has ()`, which returns true is there are remaining tokens and `peek ()` which returns the next token but does not advance the input). It only parses a second expression if that token is in the set `FIRST(expr)` (tokens that could possible begin an `expr`). If the token is not in `FIRST(expr)`, this procedure simply returns the first expression it parsed (the function `FIRSTexpr` returns an `option` value rather than true or false because it's returning the position record which keeps track of line and column number for tokens and AST nodes, for error handling, but it's not important for this discussion).

This technique works, sort of. It does correctly parse function application expressions and doesn't support curried functions, which is what we expected. However the new grammar is deeply flawed, and here's a bit of code that shows how wrong it is:

#+BEGIN_SRC sml
  f x + g y
#+END_SRC

This code should be parsed as:

#+BEGIN_SRC sml
  (f x) + (g y)
#+END_SRC

But because I added the new production to the top of the grammar (by which I mean the top of the precedence hiearchy), this caused function application to have the lowest precedence, rather than the highest, which is the usual precedence assigned to application in ML and most languages I'm aware of with this syntax. So with the parser I had, this code is parsed as:

#+BEGIN_SRC sml
  f (x + g)
#+END_SRC

Pretty bad!

